/*Проверка if внутри диапазона
    Напишите условие if для проверки того факта, что переменная age находится между 14 и 90 включительно.
    «Включительно» означает, что концы промежутка включены, то есть age может быть равна 14 или 90.

    var age = 91;
    if (age >= 14 && age <= 90){
        console.log (age);
    } else {
        console.log("no");
    }

*/

/*Проверка if вне диапазона
    Напишите условие if для проверки того факта, что age НЕ находится между 14 и 90 включительно.
    Сделайте два варианта условия: первый с использованием оператора НЕ !, второй – без этого оператора.


    var age = 55;
    if (age <= 14 || age >= 90){
        console.log (age);
    } else {
        console.log("no");
    }


    var age = 10;
    if (!(age >= 14 && age <= 90)) {
        console.log (age);
    } else {
        console.log("no");
    }
*/

